# Використовуємо контекст-менеджер для відкриття файлу на запис
with open("output.txt", "w") as file:
    # Записуємо кілька рядків у файл
    file.write("Це перший рядок.\n")
    file.write("Це другий рядок.\n")
    file.write("Третій рядок запису в файл.\n")

print("Текст успішно записано у файл 'output.txt'")


# Використовуємо контекст-менеджер для відкриття файлу на читання
with open("output.txt", "r") as file:
    # Читання вмісту файлу
    content = file.read()

print("Вміст файлу:")
print(content)
