# 1. Константа None, використовують для позначення відсутності значення змінної чи повернення значення функцією.

print("Перша константа: ", None)  # Виведе "Перша константа: None"

example_var = None  # Присвоюємо змінній значення None
if example_var is None:
    print("Змінна не містить значення.")  

# 2. Константа True, використовується в умовах, логічних операціях і для позначення істини.

print("Друга константа: ", True)  

# Приклад використання True
is_active = True  # Присвоєння значення True
if is_active:
    print("Статус активний.")  # Виведе "Статус активний."

# 3. Константа Ellipsis, вона зазвичай використовується як заповнювач
# або для позначення, що частина коду або виразу пропущена чи ще не реалізована.

print("Третя константа: ", Ellipsis)  

# Приклад використання Ellipsis
def some_function():
    # Тут ще не реалізовано код
    return Ellipsis

result = some_function()
if result is Ellipsis:
    print("Функція ще не реалізована.")  # Виведе "Функція ще не реалізована."

# Виведення зарезервованих слів Python
import keyword
print("\nЗарезервовані слова Python:")
print(keyword.kwlist)  # Виведе список усіх зарезервованих слів Python
