# 1. Функція abs()
# Функція abs() повертає абсолютне значення числа, тобто видаляє знак з числа.
num1 = -12.5
num2 = 12.5
print(abs(num1), f"є рівним {abs(num2)}", "і якщо порівняти то: ", abs(num1) == abs(num2))

# 2. Функція round()
# Функція round() округляє число до заданої кількості десяткових знаків.
# Якщо кількість знаків не вказана, то округляється до найближчого цілого.
float_num = 3.14159
rounded_num = round(float_num, 2)  # Округлюємо до 2 знаків після коми
print(f"Число {float_num} округлене до 2 знаків: {rounded_num}")

# 3. Функція len()
# Функція len() повертає довжину об'єкта: рядка, списку, словника або іншої колекції.
example_list = ["apple", "banana", "cherry"]
print(f"Довжина списку {example_list} становить: {len(example_list)}")
