# Приклад 1:
# Введення віку користувача
age = int(input("Введіть ваш вік: "))

# Розгалуження для перевірки віку
if age >= 18:
    print("Вітаємо, ви можете водити автомобіль!")
else:
    print("Вибачте, вам потрібно бути старше 18 років для водіння.")


# Приклад 2:
# Введення місяця (від 1 до 12)
month = int(input("Введіть номер місяця (1-12): "))

# Розгалуження для визначення сезону
if month == 12 or month == 1 or month == 2:
    print("Це зима!")
elif month == 3 or month == 4 or month == 5:
    print("Це весна!")
elif month == 6 or month == 7 or month == 8:
    print("Це літо!")
elif month == 9 or month == 10 or month == 11:
    print("Це осінь!")
else:
    print("Невірний номер місяця. Будь ласка, введіть число від 1 до 12.")
